# GetMinimum Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpatialFieldManager..::..GetMinimum Method
SpatialFieldManager Class See Also
---
Calculates the minimum value for all primitives
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double GetMinimum(
	int resultIndex,
	bool rawValue
)
```

Visual Basic
---
```text
Public Function GetMinimum ( _
	resultIndex As Integer, _
	rawValue As Boolean _
) As Double
```

Visual C++
---
```text
public:
double GetMinimum(
	int resultIndex,
	bool rawValue
)
```

# ### Parameters
resultIndex
    Type: System..::..Int32 Index of result schema
rawValue
    Type: System..::..Boolean If true returned value is NOT multiplied by the current result's units multiplier, otherwise it IS
# ### Return Value
Resulting minimum value
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InapplicableDataException | Thrown when current measurement is >= the number of measurements for at least one primitive |

# See Also
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace